{"keras_version": "2.0.6", "backend": "tensorflow", "config": {"name": "model_1", "layers": [{"name": "input_1", "config": {"batch_input_shape": [null, 2], "dtype": "float32", "name": "input_1", "sparse": false}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "dense_1", "config": {"kernel_constraint": null, "activation": "relu", "activity_regularizer": null, "bias_regularizer": null, "name": "dense_1", "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "units": 24, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Dense"}, {"name": "dense_2", "config": {"kernel_constraint": null, "activation": "relu", "activity_regularizer": null, "bias_regularizer": null, "name": "dense_2", "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "units": 48, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["dense_1", 0, 0, {}]]], "class_name": "Dense"}, {"name": "dense_3", "config": {"kernel_constraint": null, "activation": "relu", "activity_regularizer": null, "bias_regularizer": null, "name": "dense_3", "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "units": 24, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["dense_2", 0, 0, {}]]], "class_name": "Dense"}, {"name": "dense_4", "config": {"kernel_constraint": null, "activation": "tanh", "activity_regularizer": null, "bias_regularizer": null, "name": "dense_4", "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "units": 1, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["dense_3", 0, 0, {}]]], "class_name": "Dense"}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_4", 0, 0]]}, "class_name": "Model"}